import turtle

# можливі кольори:
# 'orange', 'red', 'pink', 'yellow', 'blue', 'green'
#
# можливі відтінки:
# 'light', 'dark'
#
# можливі форми черепашки:
# 'turtle', 'classic', 'arrow', 'circle'

фон_вікна = "lightgreen"

форма_черепашки = "turtle"
колір_черепашки = "blue"

перебіжок = 20
кроків_за_раз = 20
кут_поворота = 24

# - - - - - - - - - - - - - - - - - - - - - - - - - - - -

вікно = turtle.Screen()              # Створити вікно
вікно.bgcolor(фон_вікна)             # встановити фон

тортила = turtle.Turtle()            # створити черепашку
тортила.shape(форма_черепашки)       # встановити форму черепашки
тортила.color(колір_черепашки)       # встановити колір черепашки

тортила.penup()                      # підняти ручку

for i in range(перебіжок):           # повторювати кількість "перебіжок" раз:
   тортила.stamp()                   # наслідити
   кроків_за_раз = кроків_за_раз + 1 # зробити на 1 кроків_за_раз більше
   тортила.forward(кроків_за_раз)    # йти
   тортила.right(кут_поворота)       # повернути на кут_поворота градусів


вікно.mainloop()                     # лишити вікно
